In [ ]:
import pandas as pd
import psycopg2
import json
import subprocess

In [1]:
import main

Installing postgresql...
Creating user...admin
Giving admin a password...
Giving admin CREATEDB permissions...
Making admin a superuser...
no creds.json file
Creating database localhost...
Database localhost created.
Connecting to database...
Logging in as admin
Database created raw_data........
Connecting to database...
Logging in as admin
database "raw_data" already exists

Connecting to database...
Logging in as admin
Data Downloaded
Looking for schema: imports
Copying table imports.data from /home/jupyter/data_engineering_project/data/data.csv...
relation "imports.data" does not exist

Table imports.data created.
Now... copying table imports.data from /home/jupyter/data_engineering_project/data/data.csv...
Table imports.data loaded.
Data loaded
Connecting to database...
Logging in as admin
Creating Dedupe Schema...
Creating dedupe table...
Dropping old table...
Renaming new table...
Renaming new table with new schema...
Dropping cleaning schema to clean up...
imports.data has been deduped.
Whitespace inimports.data has been removed.
Connecting to database...
Logging in as admin
Creating new database...
Connecting to database...
Logging in as admin
Creating Star Schema for new tables...
CREATE SCHEMA "customer_data";

CREATE SCHEMA "order_data";

CREATE SCHEMA "loads";

CREATE EXTENSION IF NOT EXISTS dblink;

SELECT dblink_connect('conn','dbname=raw_data');

CREATE TABLE tmp_import AS
SELECT
    *
FROM
    dblink('conn', 'SELECT * FROM imports.data') T(order_id bigint,
 first_name text,
 last_name text,
 date_of_birth date,
 phone text,
 email text,
 street text,
 city text,
 postal_code bigint,
 state text,
 order_date date,
 payment_type text,
 product_name text,
 price double precision,
 quantity bigint,
 order_total double precision);

ALTER TABLE tmp_import SET SCHEMA "loads";

ALTER TABLE loads.tmp_import ADD COLUMN customer_id varchar(255);

ALTER TABLE loads.tmp_import ADD COLUMN address_id varchar(255);

UPDATE loads.tmp_import
SET customer_id = SHA256(CONCAT(first_name,'-',last_name,'-',date_of_birth)::bytea);

UPDATE loads.tmp_import
SET address_id = SHA256(CONCAT(street,'-',city,'-',postal_code)::bytea);

CREATE TABLE customer_data.customers AS
SELECT DISTINCT
    customer_id
    ,first_name
    ,last_name
    ,date_of_birth
    ,phone
    ,email
FROM loads.tmp_import;

ALTER TABLE customer_data.customers ADD PRIMARY KEY (customer_id);

CREATE TABLE customer_data.address_history AS
SELECT DISTINCT
    address_id
    ,customer_id
    ,street as street_number
    ,city
    ,postal_code
    ,state
    ,MIN(order_date) OVER (PARTITION BY customer_id,address_id) AS start_date
    ,MAX(order_date) OVER (PARTITION BY customer_id,address_id) AS end_date
FROM loads.tmp_import;

ALTER TABLE customer_data.address_history ADD PRIMARY KEY (address_id);

CREATE TABLE order_data.order_details AS
SELECT DISTINCT
   product_name
   ,order_id
   ,price
   ,quantity
   --,CONCAT("N/A") as comments
FROM loads.tmp_import;

ALTER TABLE order_data.order_details ADD status varchar(255);

UPDATE order_data.order_details
SET status = 'None';

ALTER TABLE order_data.order_details ADD comments varchar(255);

UPDATE order_data.order_details
SET comments = 'None';

CREATE TABLE order_data.orders AS
SELECT DISTINCT
   order_id
   ,customer_id
   ,order_date
   ,payment_type AS payment_method_id
   --,CONCAT("N/A") as comments
FROM loads.tmp_import;

ALTER TABLE order_data.orders ADD COLUMN comments varchar(255);

UPDATE order_data.orders
SET comments = 'None';

ALTER TABLE order_data.orders ADD PRIMARY KEY (order_id);


can't execute an empty query

In [14]:
file=json.load(open('creds.json'))

conn = psycopg2.connect(database='data_mart',\
                        user=file['username'],\
                        password=file['password'],\
                        host='127.0.0.1',\
                        port= '5432')

cursor = conn.cursor()

In [15]:
#Select all table names in data_mart
sql = """
SELECT table_schema
        , table_name 
FROM 
    information_schema.tables
WHERE 
    table_schema NOT IN ('pg_catalog', 'information_schema')"""
cursor.execute(sql)
cursor.fetchall()
#{t[0]:t[1] for t in cursor.fetchall()}

[('loads', 'tmp_import'),
 ('customer_data', 'customers'),
 ('customer_data', 'address_history'),
 ('order_data', 'order_details'),
 ('order_data', 'orders')]

In [10]:
#cursor.close()
#conn.close()

In [16]:
#read a table from a postgres database using pandas
df = pd.read_sql('select * from loads.tmp_import', con=conn)

/var/tmp/ipykernel_39462/2673272983.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('select * from loads.tmp_import', con=conn)

In [17]:
df.columns

Index(['order_id', 'first_name', 'last_name', 'date_of_birth', 'phone',
       'email', 'street', 'city', 'postal_code', 'state', 'order_date',
       'payment_type', 'product_name', 'price', 'quantity', 'order_total',
       'customer_id', 'address_id'],
      dtype='object')

In [18]:
#count the number of records in a df, grouped by first_name last_name

df[['first_name', 'last_name','date_of_birth',"street","city","state","postal_code"]]\
.groupby(['first_name', 'last_name','date_of_birth']).value_counts()

first_name  last_name  date_of_birth  street                      city           state  postal_code
Albina      Glick      1979-01-10     4 Ralph Ct                  Dunellen       NJ     8812            3
Allene      Iturbide   1979-01-02     1 Central Ave               Stevens Point  WI     54481           4
Amber       Monarrez   1979-02-02     55262 N French Rd           Indianapolis   IN     46240           5
Arlette     Honeywell  1979-02-28     30553 Washington Rd         Plainfield     NJ     7062            1
Art         Venere     1974-01-10     8 W Cerritos Ave #54        Bridgeport     NJ     8014            4
Bernardo    Figeroa    1979-01-06     386 9th Ave N               Conroe         TX     77301           1
Bette       Nicka      1978-12-28     6 S 33rd St                 Aston          PA     19014           3
Blondell    Pugh       1979-02-06     201 Hawk Ct                 Providence     RI     2904            2
Brock       Bolognia   1979-01-27     422 E 21st St               Syracuse       NY     13214           5
Cammy       Albares    1978-09-22     56 E Morehead St            Laredo         TX     78045           4
Carma       Vanheusen  1979-03-13     4 Bloomfield Ave            Irving         TX     75061           4
Carmelina   Lindall    1979-02-09     2664 Lewis Rd               Littleton      CO     80126           3
Cecily      Hollack    1979-02-08     1 Huntwood Ave              Phoenix        AZ     85017           1
Cory        Gibes      1979-03-09     2 Se 3rd Ave                Mesquite       TX     75149           3
Delisa      Crupi      1979-02-23     47565 W Grand Ave           Newark         NJ     7105            7
Dyan        Oldroyd    1979-01-18     7219 Woodfield Rd           Overland Park  KS     66204           9
Elza        Lipke      1979-02-25     6794 Lake Dr E              Newark         NJ     7104            3
Emerson     Bowley     1979-01-25     762 S Main St               Madison        WI     53711           1
Erick       Ferencz    1979-01-21     20 S Babcock St             Fairbanks      AK     99712           5
Ezekiel     Chui       1979-01-04     4646 Kaahumanu St           Hackensack     NJ     7601            6
Gladys      Rim        1978-12-25     2239 Shawnee Mission Pky    Tullahoma      TN     37388           5
                                      322 New Horizon Blvd        Milwaukee      WI     53207           2
Graciela    Ruta       1978-03-21     8 Industry Ln               New York       NY     10002           3
Ilene       Eroman     1979-02-14     2853 S Central Expy         Glen Burnie    MD     21061           5
Jamal       Vanausdal  1979-02-07     1 N Harlem Ave #9           Orange         NJ     7050            2
James       Butt       1978-12-08     2409 Alabama Rd             Riverside      CA     92501           3
Jina        Briddick   1979-01-23     32860 Sierra Rd             Miami          FL     33133           9
Kallie      Blackwood  1979-02-16     701 S Harrison Rd           San Francisco  CA     94104           2
Kati        Rulapaugh  1979-01-16     6980 Dorsett Rd             Abilene        KS     67410           2
Lai         Gato       1979-03-05     555 Main St                 Erie           PA     16502           3
                                      9 Norristown Rd             Troy           NY     12180           2
Laurel      Reitler    1979-02-22     6 Kains Ave                 Baltimore      MD     21215           1
Lavera      Perin      1979-01-20     798 Lund Farm Way           Rockaway       NJ     7866            6
Leota       Dilliard   2056-09-15     7 W Jackson Blvd            San Jose       CA     95111           4
Lettie      Isenhower  1979-03-02     5161 Dorsett Rd             Homestead      FL     33030           7
                                      70 W Main St                Beachwood      OH     44122           4
Lorrie      Nestle     1979-01-28     501 N 19th Ave              Cherry Hill    NJ     8002           10
                                      39 S 7th St                 Tullahoma      TN     37388           1
Malinda     Hochard    1979-03-14     6 Gilson St                 Bronx          NY     10468           2
Maurine     Yglesias   1979-02-10     59 Shady Ln #53             Milwaukee      WI     53214           5
Minna       Amigon     2063-05-18     2371 Jerrold Ave            Kulpsville     PA     19443           3
Mitsue      Tollner    2064-03-14     7 Eads St                   Chicago        IL     60632           5
Myra        Munns      1979-03-03     81 Norris Ave #525          Ronkonkoma     NY     11779           6
Sabra       Uyetake    1979-01-29     98839 Hawthorne Blvd #6101  Columbia       SC     29201           5
Sage        Wieser     1998-09-16     5 Boston Ave #88            Sioux Falls    SD     57105           3
Shenika     Seewald    1979-02-03     303 N Radcliffe St          Hilo           HI     96720           3
Solange     Shinko     1979-01-12     84 Bloomfield Ave           Spartanburg    SC     29301           6
Stephaine   Barfield   1979-03-04     47154 Whipple Ave Nw        Gardena        CA     90247           3
Stephen     Emigh      1979-03-06     3777 E Richmond St #900     Akron          OH     44302           4
Tamar       Hoogland   1979-02-20     1321 Balsam                 Boulder        CO     80026           2
Tammara     Wardrip    1979-03-08     4800 Black Horse Pike       Burlingame     CA     94010           6
Timothy     Mulqueen   1979-02-27     7 Benton Dr                 Honolulu       HI     96819           9
                                      44 W 4th St                 Staten Island  NY     10309           2
Tyra        Shields    1979-03-07     72 Mannix Dr                Cincinnati     OH     45203           3
Valentine   Gillian    1979-01-15     775 W 17th St               San Antonio    TX     78204           2
Vallie      Mondella   1979-02-15     74 W College St             Boise          ID     83707           4
                                      455 N Main Ave              Garden City    NY     11530           1
Veronika    Inouye     1978-12-29     6 Greenleaf Ave             San Jose       CA     95111           3
Wilda       Giguere    1979-03-11     1747 Calle Amanecer #2      Anchorage      AK     99501           1
Willow      Kusko      1979-01-05     90991 Thorburn Ave          New York       NY     10011           1
dtype: int64

In [19]:
df[['first_name', 'last_name','date_of_birth',"street","city","state","postal_code",'customer_id','address_id']]\
.groupby(['first_name', 'last_name','date_of_birth'])['customer_id'].nunique()
#.agg({'first_name': 'count', 'last_name': 'count', 'date_of_birth': 'count', 'street': 'count', 'city': 'count', 'state': 'count', 'postal_code': 'count'})

first_name  last_name  date_of_birth
Albina      Glick      1979-01-10       1
Allene      Iturbide   1979-01-02       1
Amber       Monarrez   1979-02-02       1
Arlette     Honeywell  1979-02-28       1
Art         Venere     1974-01-10       1
Bernardo    Figeroa    1979-01-06       1
Bette       Nicka      1978-12-28       1
Blondell    Pugh       1979-02-06       1
Brock       Bolognia   1979-01-27       1
Cammy       Albares    1978-09-22       1
Carma       Vanheusen  1979-03-13       1
Carmelina   Lindall    1979-02-09       1
Cecily      Hollack    1979-02-08       1
Cory        Gibes      1979-03-09       1
Delisa      Crupi      1979-02-23       1
Dyan        Oldroyd    1979-01-18       1
Elza        Lipke      1979-02-25       1
Emerson     Bowley     1979-01-25       1
Erick       Ferencz    1979-01-21       1
Ezekiel     Chui       1979-01-04       1
Gladys      Rim        1978-12-25       1
Graciela    Ruta       1978-03-21       1
Ilene       Eroman     1979-02-14       1
Jamal       Vanausdal  1979-02-07       1
James       Butt       1978-12-08       1
Jina        Briddick   1979-01-23       1
Kallie      Blackwood  1979-02-16       1
Kati        Rulapaugh  1979-01-16       1
Lai         Gato       1979-03-05       1
Laurel      Reitler    1979-02-22       1
Lavera      Perin      1979-01-20       1
Leota       Dilliard   2056-09-15       1
Lettie      Isenhower  1979-03-02       1
Lorrie      Nestle     1979-01-28       1
Malinda     Hochard    1979-03-14       1
Maurine     Yglesias   1979-02-10       1
Minna       Amigon     2063-05-18       1
Mitsue      Tollner    2064-03-14       1
Myra        Munns      1979-03-03       1
Sabra       Uyetake    1979-01-29       1
Sage        Wieser     1998-09-16       1
Shenika     Seewald    1979-02-03       1
Solange     Shinko     1979-01-12       1
Stephaine   Barfield   1979-03-04       1
Stephen     Emigh      1979-03-06       1
Tamar       Hoogland   1979-02-20       1
Tammara     Wardrip    1979-03-08       1
Timothy     Mulqueen   1979-02-27       1
Tyra        Shields    1979-03-07       1
Valentine   Gillian    1979-01-15       1
Vallie      Mondella   1979-02-15       1
Veronika    Inouye     1978-12-29       1
Wilda       Giguere    1979-03-11       1
Willow      Kusko      1979-01-05       1
Name: customer_id, dtype: int64

In [20]:
df[['first_name', 'last_name','date_of_birth',"street","city","state","postal_code",'customer_id','address_id']]\
.groupby(['first_name', 'last_name','date_of_birth'])['address_id'].nunique()

first_name  last_name  date_of_birth
Albina      Glick      1979-01-10       1
Allene      Iturbide   1979-01-02       1
Amber       Monarrez   1979-02-02       1
Arlette     Honeywell  1979-02-28       1
Art         Venere     1974-01-10       1
Bernardo    Figeroa    1979-01-06       1
Bette       Nicka      1978-12-28       1
Blondell    Pugh       1979-02-06       1
Brock       Bolognia   1979-01-27       1
Cammy       Albares    1978-09-22       1
Carma       Vanheusen  1979-03-13       1
Carmelina   Lindall    1979-02-09       1
Cecily      Hollack    1979-02-08       1
Cory        Gibes      1979-03-09       1
Delisa      Crupi      1979-02-23       1
Dyan        Oldroyd    1979-01-18       1
Elza        Lipke      1979-02-25       1
Emerson     Bowley     1979-01-25       1
Erick       Ferencz    1979-01-21       1
Ezekiel     Chui       1979-01-04       1
Gladys      Rim        1978-12-25       2
Graciela    Ruta       1978-03-21       1
Ilene       Eroman     1979-02-14       1
Jamal       Vanausdal  1979-02-07       1
James       Butt       1978-12-08       1
Jina        Briddick   1979-01-23       1
Kallie      Blackwood  1979-02-16       1
Kati        Rulapaugh  1979-01-16       1
Lai         Gato       1979-03-05       2
Laurel      Reitler    1979-02-22       1
Lavera      Perin      1979-01-20       1
Leota       Dilliard   2056-09-15       1
Lettie      Isenhower  1979-03-02       2
Lorrie      Nestle     1979-01-28       2
Malinda     Hochard    1979-03-14       1
Maurine     Yglesias   1979-02-10       1
Minna       Amigon     2063-05-18       1
Mitsue      Tollner    2064-03-14       1
Myra        Munns      1979-03-03       1
Sabra       Uyetake    1979-01-29       1
Sage        Wieser     1998-09-16       1
Shenika     Seewald    1979-02-03       1
Solange     Shinko     1979-01-12       1
Stephaine   Barfield   1979-03-04       1
Stephen     Emigh      1979-03-06       1
Tamar       Hoogland   1979-02-20       1
Tammara     Wardrip    1979-03-08       1
Timothy     Mulqueen   1979-02-27       2
Tyra        Shields    1979-03-07       1
Valentine   Gillian    1979-01-15       1
Vallie      Mondella   1979-02-15       2
Veronika    Inouye     1978-12-29       1
Wilda       Giguere    1979-03-11       1
Willow      Kusko      1979-01-05       1
Name: address_id, dtype: int64

In [21]:
[('loads', 'tmp_import'),
 ('customer_data', 'customers'),
 ('customer_data', 'address_history'),
 ('order_data', 'order_details'),
 ('order_data', 'orders')]

[('loads', 'tmp_import'),
 ('customer_data', 'customers'),
 ('customer_data', 'address_history'),
 ('order_data', 'order_details'),
 ('order_data', 'orders')]

In [27]:
pd.read_sql('select * from customer_data.customers', con=conn).head(10)

/var/tmp/ipykernel_39462/2806696790.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql('select * from customer_data.customers', con=conn).head(10)

,customer_id,first_name,last_name,date_of_birth,phone,email
0,\xb792e6327a47271c310f58031374a3512ec650b689e2...,Malinda,Hochard,1979-03-14,317-722-5066,malinda.hochard@yahoo.com
1,\x173340a7c74ad18370a20dcbd486b598ff7ae6b0d662...,Albina,Glick,1979-01-10,732-924-7882,albina@glick.com
2,\xa7435a65a7e03a7f23533edf8375daf8f667c93090b3...,Allene,Iturbide,1979-01-02,715-662-6764,allene_iturbide@cox.net
3,\xc6d188bf1cc6c8c60ff64157303cc8985658f399860d...,Cory,Gibes,1979-03-09,626-572-1096,cory.gibes@gmail.com
4,\x62a2a8e32e53edb4800107b7bab342b4df8ef3ea0536...,Ilene,Eroman,1979-02-14,410-914-9018,ilene.eroman@hotmail.com
5,\x670b767168e36ff8fc8175f5aa715eda4ea94cdf02b7...,Vallie,Mondella,1979-02-15,208-862-5339,vmondella@mondella.com
6,\x7ba38823694b2ad8022642df27d970f814e575365a38...,Cammy,Albares,1978-09-22,956-537-6195,calbares@gmail.com
7,\xf819b452b787e756f9d51c382f82128c26a4b2d14ea7...,Dyan,Oldroyd,1979-01-18,913-413-4604,doldroyd@aol.com
8,\x7883b284e12c57017be0b75110d420e7a9ef460ca4b6...,Emerson,Bowley,1979-01-25,608-336-7444,emerson.bowley@bowley.org
9,\x180bc838a001fb45074e90a0647bed47178dbe1380df...,Gladys,Rim,1978-12-25,414-661-9598,gladys.rim@rim.org

In [28]:
pd.read_sql('select * from customer_data.address_history', con=conn).sort_values('customer_id').head(10)

/var/tmp/ipykernel_39462/2668644802.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql('select * from customer_data.address_history', con=conn).sort_values('customer_id').head(10)

,address_id,customer_id,street_number,city,postal_code,state,start_date,end_date
38,\x547bf2b5a532739b71e298ab104c4886a45f9931e567...,\x01a68ce3aabaaa3fcc8fa58bfd4f84a044947996fd59...,3777 E Richmond St #900,Akron,44302,OH,2015-02-26,2015-06-18
13,\x23e1c7eebe0fcb38bfb4c58280a3ed78cff4312dd70b...,\x04e39f45829b3256718e228e2c69e2ff10cc4102a6b8...,2371 Jerrold Ave,Kulpsville,19443,PA,2014-03-16,2016-06-18
53,\x6329c1db2f3070c153a185f48ad08c620a232795d5b4...,\x0516679ca04d7ec69dafa30c78fcbf53e65b0ef0dd33...,386 9th Ave N,Conroe,77301,TX,2013-07-09,2013-07-09
59,\x23cb652d80ad12872d7801feff5dc900ba9443033bb6...,\x0c74702d9a075245b45d32b0bb1b397b2d513768842c...,70 W Main St,Beachwood,44122,OH,2016-03-28,2016-03-28
52,\x4858de7b76f57ff3a27a556c5a650d2e457d6a6f563f...,\x0c74702d9a075245b45d32b0bb1b397b2d513768842c...,5161 Dorsett Rd,Homestead,33030,FL,2016-01-30,2016-01-30
8,\xae231da01a752ffedde5f5505a72a97f3241ca1f6695...,\x1563cbad451cdba0298fabbc2d76178b7a6ceebb29c5...,2664 Lewis Rd,Littleton,80126,CO,2015-07-23,2015-07-23
29,\xacb448f236fd0d380f998020d292956eedb2c50dd2f9...,\x173340a7c74ad18370a20dcbd486b598ff7ae6b0d662...,4 Ralph Ct,Dunellen,8812,NJ,2013-07-01,2013-07-01
42,\xe80ebcce1f4bc2b5fb922a414234340a9ff789cea399...,\x17b964b2e1a33c217ac4d6f71199c821ae04895427d4...,30553 Washington Rd,Plainfield,7062,NJ,2014-11-10,2014-11-10
56,\x6a419d1d8efcc51753c7494e436f29284d6063ba51b4...,\x180bc838a001fb45074e90a0647bed47178dbe1380df...,2239 Shawnee Mission Pky,Tullahoma,37388,TN,2013-05-06,2013-05-06
11,\xce38e1f08acbf647641a0f7e41804520a3b09450f536...,\x180bc838a001fb45074e90a0647bed47178dbe1380df...,322 New Horizon Blvd,Milwaukee,53207,WI,2017-02-02,2017-02-02

In [29]:
pd.read_sql('select * from order_data.order_details', con=conn).head(10)

/var/tmp/ipykernel_39462/3394181080.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql('select * from order_data.order_details', con=conn).head(10)

   product_name  order_id  price  quantity comments
0      Ron-Flex        15   3.99         1     None
1     Mat Danin        36  94.99         3     None
2  Trans Zimnix        22  17.99         4     None
3  Trans Zimnix        92  10.99         1     None
4      Dentodox        31   5.99         1     None
5      Spanfind        31  72.99         3     None
6     Strongtam        41  50.99         4     None
7       Runhome        80  33.99         1     None
8    Stimstring        12  30.99         3     None
9        Redtom        33  90.99         2     None

In [30]:
pd.read_sql('select * from order_data.orders', con=conn).head(10)

/var/tmp/ipykernel_39462/566335479.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql('select * from order_data.orders', con=conn).head(10)

,order_id,customer_id,order_date,payment_method_id,comments
0,21,\x62a2a8e32e53edb4800107b7bab342b4df8ef3ea0536...,2017-01-02,ACH,None
1,50,\xd5169815bc622295666e2a920433ca2e889085daff2f...,2016-08-06,VISA,None
2,3,\xf8e87f42ce6114735a829d613995c57b9b5251acdc2f...,2016-11-29,VISA,None
3,29,\xb7e3b60b0014bf1a7b2718f2bfcf9c09981ff034e2cd...,2016-11-14,VISA,None
4,99,\x01a68ce3aabaaa3fcc8fa58bfd4f84a044947996fd59...,2015-06-18,VISA,None
5,7,\xb792e6327a47271c310f58031374a3512ec650b689e2...,2014-01-28,MASTER CARD,None
6,5,\xacbca24b7f82f7dd716511d7f19921575ed3338c1d7e...,2016-11-15,MASTER CARD,None
7,86,\x62a73b3a4c3f3fa5e07c126b211455c695409c88b080...,2015-08-06,MASTER CARD,None
8,94,\xd2ceae345ad9b173decfefeddb164a3c3fcdd7bf5b61...,2015-12-31,VISA,None
9,41,\x7ba38823694b2ad8022642df27d970f814e575365a38...,2015-06-15,ACH,None